This appears to work from the plan I've got:
```
  # module.usdod_saber_org_cloudtrail.aws_cloudtrail.main will be created
  + resource "aws_cloudtrail" "main" {
      + arn                           = (known after apply)
      + cloud_watch_logs_group_arn    = (known after apply)
      + cloud_watch_logs_role_arn     = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = true
      + name                          = "cloudtrail"
      + s3_bucket_name                = (known after apply)
      + s3_key_prefix                 = "cloudtrail"
    }

  # module.usdod_saber_org_cloudtrail.aws_cloudwatch_log_group.cloudtrail will be created
  + resource "aws_cloudwatch_log_group" "cloudtrail" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "cloudtrail-events"
      + retention_in_days = 90
    }

  # module.usdod_saber_org_cloudtrail.aws_iam_policy.cloudtrail_cloudwatch_logs will be created
  + resource "aws_iam_policy" "cloudtrail_cloudwatch_logs" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "cloudtrail-cloudwatch-logs-policy"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-west-2:937541588026:log-group:cloudtrail-events:*"
                      + Sid      = "WriteCloudWatchLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.usdod_saber_org_cloudtrail.aws_iam_policy_attachment.main will be created
  + resource "aws_iam_policy_attachment" "main" {
      + id         = (known after apply)
      + name       = "cloudtrail-cloudwatch-logs-policy-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "cloudtrail-cloudwatch-logs-role",
        ]
    }

  # module.usdod_saber_org_cloudtrail.aws_iam_role.cloudtrail_cloudwatch_role will be created
  + resource "aws_iam_role" "cloudtrail_cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudtrail-cloudwatch-logs-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }
```